Revit 2026 API

# MEPSpaceConstructionSpaceConstructions Property

---

Return all the Space constructions of current space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPBuildingConstructionSet SpaceConstructions { get; }
```
```vb
Public ReadOnly Property SpaceConstructions As MEPBuildingConstructionSet
	Get
```
```cpp
public:
property MEPBuildingConstructionSet^ SpaceConstructions {
	MEPBuildingConstructionSet^ get ();
}
```
```fsharp
member SpaceConstructions : MEPBuildingConstructionSet with get
```

#### Property Value

MEPBuildingConstructionSet

If the name is same with the existing one, an exception will be thrown.

#### Reference

MEPSpaceConstruction Class

Autodesk.Revit.DB.Mechanical Namespace